# ============================================
# LEVEL 1: PARSON PROBLEMS (INTERMEDIATE)
# ============================================
# Соберите программу из перепутанных строк кода!
# Время выполнения: 30-40 минут
# ============================================

"""
🧩 ЧТО ТАКОЕ PARSON PROBLEMS?

Это задачи, где:
1. Даны все строки кода
2. Но они перепутаны
3. Нужно расставить в правильном порядке
4. Иногда есть лишние строки (отвлекающие)

Уровень 1 — сложнее Level 0:
✅ Условия (if/elif/else)
✅ Строковые методы
✅ Срезы
✅ Списки

💡 Если забыли синтаксис — смотрите solutions!
"""

print("="*60)
print("ЗАДАЧА 1: ПРОВЕРКА ВОЗРАСТА")
print("="*60)

print("""
📋 ПЕРЕПУТАННЫЕ СТРОКИ:

A) def check_age():
B)     age = int(input("Сколько вам лет? "))
C)     age = input("Сколько вам лет? ")
D)     if age >= 18:
E)         print("Взрослый")
F)     elif age >= 13:
G)         print("Подросток")
H)     else:
I)         print("Ребёнок")
J)     if age > 18:

# Вызов функции:
check_age()

🎯 ОЖИДАЕМЫЙ РЕЗУЛЬТАТ:
Сколько вам лет? 25
Взрослый

💡 ПЕРВАЯ ЗАДАЧА - ОБУЧАЮЩАЯ:
1. Определите какие строки нужны
2. Какие строки лишние/неправильные?
3. В каком порядке расставить?
4. Где нужны отступы?
5. Напишите функцию в правильном порядке
""")

print("\n--- Ваше решение (задание 1) ---")
# Напишите правильный код:




print("\n" + "="*60)
print("ЗАДАЧА 2: ПРОВЕРКА ПАЛИНДРОМА")
print("="*60)

print("""
📋 ПЕРЕПУТАННЫЕ СТРОКИ:

A) def is_palindrome():
B)     word = input("Введите слово: ")
C)     word = word.strip().lower()
D)     reversed_word = word[::-1]
E)     reversed_word = word.reverse()
F)     if word == reversed_word:
G)         print("Это палиндром!")
H)     else:
I)         print("Это не палиндром")
J)     elif word == reversed_word:

is_palindrome()

🎯 ОЖИДАЕМЫЙ РЕЗУЛЬТАТ:
Введите слово: радар
Это палиндром!
""")

print("\n--- Ваше решение (задание 2) ---")
# Напишите правильный код:




print("\n" + "="*60)
print("ЗАДАЧА 3: АНАЛИЗАТОР ПАРОЛЯ")
print("="*60)

print("""
📋 ПЕРЕПУТАННЫЕ СТРОКИ:

A) def check_password():
B)     password = input("Введите пароль: ")
C)     length = len(password)
D)     length = password.length()
E)     if length >= 8:
F)         print("Сильный пароль")
G)     elif length >= 5:
H)         print("Средний пароль")
I)     else:
J)         print("Слабый пароль")
K)     if length > 8:

check_password()

🎯 ОЖИДАЕМЫЙ РЕЗУЛЬТАТ:
Введите пароль: MyPass123
Сильный пароль
""")

print("\n--- Ваше решение (задание 3) ---")
# Напишите правильный код:




print("\n" + "="*60)
print("ЗАДАЧА 4: ИЗВЛЕЧЕНИЕ ИМЕНИ ИЗ EMAIL")
print("="*60)

print("""
📋 ПЕРЕПУТАННЫЕ СТРОКИ:

A) def extract_username():
B)     email = input("Email: ")
C)     at_index = email.index("@")
D)     at_index = email.find("@")
E)     username = email[:at_index]
F)     username = email[0:at_index]
G)     print("Username:", username)

extract_username()

🎯 ОЖИДАЕМЫЙ РЕЗУЛЬТАТ:
Email: user@example.com
Username: user
""")

print("\n--- Ваше решение (задание 4) ---")
# Напишите правильный код:




print("\n" + "="*60)
print("ЗАДАЧА 5: НОРМАЛИЗАЦИЯ ТЕКСТА")
print("="*60)

print("""
📋 ПЕРЕПУТАННЫЕ СТРОКИ:

A) def normalize_text():
B)     text = input("Текст: ")
C)     text = text.strip()
D)     text = text.lower()
E)     text = text.upper()
F)     text = text.replace("  ", " ")
G)     words = text.split()
H)     text = " ".join(words)
I)     print("Результат:", text)

normalize_text()

🎯 ОЖИДАЕМЫЙ РЕЗУЛЬТАТ:
Текст:   ПРИВЕТ    МИР
Результат: привет мир
""")

print("\n--- Ваше решение (задание 5) ---")
# Напишите правильный код:




print("\n" + "="*60)
print("ЗАДАЧА 6: ПОДСЧЁТ ГЛАСНЫХ")
print("="*60)

print("""
📋 ПЕРЕПУТАННЫЕ СТРОКИ:

A) def count_vowels():
B)     text = input("Текст: ").lower()
C)     vowels = "аеёиоуыэюя"
D)     count = 0
E)     for char in text:
F)         if char in vowels:
G)             count += 1
H)         if char == vowels:
I)     print("Гласных:", count)

count_vowels()

🎯 ОЖИДАЕМЫЙ РЕЗУЛЬТАТ:
Текст: Привет мир
Гласных: 3
""")

print("\n--- Ваше решение (задание 6) ---")
# Напишите правильный код:




print("\n" + "="*60)
print("ЗАДАЧА 7: РЕВЕРС СЛОВ")
print("="*60)

print("""
📋 ПЕРЕПУТАННЫЕ СТРОКИ:

A) def reverse_words():
B)     text = input("Текст: ")
C)     words = text.split()
D)     words = text.split(" ")
E)     reversed_words = words[::-1]
F)     reversed_words = words.reverse()
G)     result = " ".join(reversed_words)
H)     result = reversed_words.join(" ")
I)     print("Результат:", result)

reverse_words()

🎯 ОЖИДАЕМЫЙ РЕЗУЛЬТАТ:
Текст: Привет как дела
Результат: дела как Привет
""")

print("\n--- Ваше решение (задание 7) ---")
# Напишите правильный код:




print("\n" + "="*60)
print("ЗАДАЧА 8: ПОИСК МАКСИМУМА (СЛОЖНАЯ)")
print("="*60)

print("""
📋 ПЕРЕПУТАННЫЕ СТРОКИ:

A) def find_max_in_list():
B)     numbers = [15, 8, 23, 4, 42, 16]
C)     max_num = numbers[0]
D)     max_num = 0
E)     for num in numbers:
F)         if num > max_num:
G)             max_num = num
H)         if num >= max_num:
I)     print("Максимум:", max_num)

find_max_in_list()

🎯 ОЖИДАЕМЫЙ РЕЗУЛЬТАТ:
Максимум: 42
""")

print("\n--- Ваше решение (задание 8) ---")
# Напишите правильный код:




# ============================================
# БОНУСНАЯ ЗАДАЧА
# ============================================
print("\n" + "="*60)
print("🏆 БОНУС: ФИЛЬТР ЧЁТНЫХ ЧИСЕЛ")
print("="*60)

print("""
📋 ПЕРЕПУТАННЫЕ СТРОКИ:

A) def filter_even_numbers():
B)     numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
C)     even_numbers = []
D)     for num in numbers:
E)         if num % 2 == 0:
F)             even_numbers.append(num)
G)         if num / 2 == 0:
H)     print("Чётные:", even_numbers)

filter_even_numbers()

🎯 ОЖИДАЕМЫЙ РЕЗУЛЬТАТ:
Чётные: [2, 4, 6, 8, 10]
""")

print("\n--- Ваше решение (бонус) ---")
# Напишите правильный код:




# ============================================
# ПРОВЕРКА НАВЫКОВ
# ============================================
print("\n" + "="*60)
print("✅ ЧТО ВЫ ПРАКТИКОВАЛИ")
print("="*60)

print("""
После Parson Problems вы должны:

✅ Быстрее читать чужой код
✅ Понимать структуру программы
✅ Видеть, где нужны отступы
✅ Находить лишние/ошибочные строки
✅ Понимать порядок выполнения команд

💡 Ответы смотрите в solutions_level1.md!
""")

print("\n" + "="*60)
print("🎉 PARSON PROBLEMS LEVEL 1 ЗАВЕРШЕНЫ!")
print("="*60)
print("\n📍 Следующий шаг: test_driven_level1.py")
